OrderManager/EBU_DataMigration/orderGeneration/config/submitOrderTemplate.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:java="java:com.granite.custom.stc.transport.siebel">
   <soapenv:Header/>
   <soapenv:Body>
      <java:submitOrder>
         <message>
            <CustomerIdNumber>CUSTOMER_NUMBER</CustomerIdNumber>
            <AccountNumber>ACCOUNT_NUMBER</AccountNumber>
            <OrderNumber>ORDER_NUMBER</OrderNumber>
            <OrderType>I</OrderType>
            <OrderStatus>New</OrderStatus>
            <CreationDate>CREATION_DATE</CreationDate>
            <CreatedBy>Migrated data from ICMS</CreatedBy>
            <CreatedByName>Migrated data from ICMS</CreatedByName>
            <ServiceDate>SERVICE_DATE</ServiceDate>
            <Priority>Standard</Priority>
            <Remarks>REMARKS</Remarks>
            <ICMSSalesOrderNumber>Migrated ORDER_NUMBER</ICMSSalesOrderNumber>
            <BusinessUnit>Enterprise</BusinessUnit>
            <ParentLineItems>
               <LineItemType>Root</LineItemType>
               <Priority>1</Priority>
               <Action>A</Action>
               <ServiceType>CIRCUIT_CATEGORY</ServiceType>
               <ServiceNumber>PATH_NAME</ServiceNumber>
               <ProductType>CIRCUIT_CATEGORY</ProductType>
               <Remarks>REMARKS</Remarks>
               <IcmsSONumber>Migrated ORDER_NUMBER</IcmsSONumber>
               <FictBillingNumber>ACCESS_NUMBER</FictBillingNumber>
               <BandWidth>BANDWIDTH</BandWidth>
               <AccountNumber>ACCOUNT_NUMBER</AccountNumber>
               <LocationACity/>
               <LocationACCLICode>SITE_A</LocationACCLICode>
               <LocationAAccessCircuit/>
               <LocationAJVCode/>
               <LocationAExchangeSwCode/>
               <LocationAAccessType/>
               <LocationAPlateID>SITE_A</LocationAPlateID>
               <LocationAoldPlateId/>
               <LocationAContactAddress>NA</LocationAContactAddress>
               <LocationAContactName>NA</LocationAContactName>
               <LocationAContactTelNo>NA</LocationAContactTelNo>
               <LocationAContactEmail/>
               <LocAUnitNumber/>
               <LocationAInterface/>
               <LocationARemarks/>
               <LocationBCity/>
               <LocationBCCLICode>SITE_B</LocationBCCLICode>
               <LocationBAccessCircuit/>
               <LocationBJVCode/>
               <LocationBExchangeSwCode/>
               <LocationBAccessType/>
               <LocationBPlateID>SITE_B</LocationBPlateID>
               <LocationBoldPlateId/>
               <LocationBContactAddress>NA</LocationBContactAddress>
               <LocationBContactName>NA</LocationBContactName>
               <LocationBContactTelNo>NA</LocationBContactTelNo>
               <LocationBContactEmail/>
               <LocBUnitNumber/>
               <LocationBInterface/>
               <LocationBRemarks/>
               <TbPortNumber/>
               <Wires/>
               <ServiceDate>SERVICE_DATE</ServiceDate>
               <CreationDate>CREATION_DATE</CreationDate>
               <ParentLineItemIdentifer>PATH_NAME</ParentLineItemIdentifer>
               <ParentLineItemNameValueParameters>
                  <NameValue>
                     <Name>Sub Order Type</Name>
                     <Value>New</Value>
                     <Action>Add</Action>
                  </NameValue>
                  <NameValue>
                     <Name>GRAN-X</Name>
                     <Value>Y</Value>
                     <Action>Add</Action>
                  </NameValue>
               </ParentLineItemNameValueParameters>
            </ParentLineItems>
         </message>
      </java:submitOrder>
   </soapenv:Body>
</soapenv:Envelope>